<?php
  class Card {
    private $cards;

    public function __construct() {
      // $this->cards = [
      //   "スペード" => ["A", "2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K"],
      //   "ハート" => ["A", "2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K"],
      //   "ダイヤ" => ["A", "2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K"],
      //   "クラブ" => ["A", "2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K"]
      // ];
      $this->cards = [
        "スペード" => ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "10", "10", "10"],
        "ハート" => ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "10", "10", "10"],
        "ダイヤ" => ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "10", "10", "10"],
        "クラブ" => ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "10", "10", "10"]
      ];
    }

    public function getCards() {
      return $this->cards;
    }

    public function drawCard() {
      $mark = array_rand($this->cards);
      $number = array_splice($this->cards[$mark], array_rand($this->cards[$mark]), 1)[0];
      return [$mark, $number];
    }
  }
?>
